little-books/4-the-little-typer/ch07/dependent-types.org
#+TITLE: Dependent Types
#+OPTIONS: toc:nil num:nil author:nil timestamp:nil
#+EXPORT_FILE_NAME: index.html
* Definition
A dependent type is *a type that is defined by something that is not a type*.

* Induction on Natural Numbers
 - Induction involves a proof of N=0, then of N+1
 - In Pie, induction on Nat uses the form =ind-Nat=
 - =ind-Nat= can do everything =rec-Nat= can do, plus work with dependent types
 - =ind-Nat= takes an extra argument between the target and the base called the motive
 - The motive is a function that returns the type of the expression at every step
   - this includes the base step
   - this means the motive determines the type of the =ind-Nat= expression as a whole

#+begin_example

(ind-Nat target
  motive
  base
  step)

#+end_example

We said above that =ind-Nat= behaves like =rec-Nat= except that we can use it
with dependent types. This means that base and step return different dependent
types. The arguments to =ind-Nat= are:

- =target= : the initial =Nat=
- =motive= : a function that is applied to the target at each step to
  determine the type returned by that step, or the base when the
  target is =zero=
- =base= : the value to return when the =target= is =zero=
- =step= : a function that accepts the value under the =add1= and the
  recursive result of the computation at that step. The value of the
  final (top-most) =step= is the value of the =ind-Nat= expression.

The workings of =ind-Nat= are best illustrated by example.

