little-books/4-the-little-typer/ch07/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dependent Types</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Dependent Types</h1>
<div id="outline-container-orgf53fa3c" class="outline-2">
<h2 id="orgf53fa3c">Definition</h2>
<div class="outline-text-2" id="text-orgf53fa3c">
<p>
A dependent type is <b>a type that is defined by something that is not a type</b>.
</p>
</div>
</div>

<div id="outline-container-org39b28e0" class="outline-2">
<h2 id="org39b28e0">Induction on Natural Numbers</h2>
<div class="outline-text-2" id="text-org39b28e0">
<ul class="org-ul">
<li>Induction involves a proof of N=0, then of N+1</li>
<li>In Pie, induction on Nat uses the form <code>ind-Nat</code></li>
<li><code>ind-Nat</code> can do everything <code>rec-Nat</code> can do, plus work with dependent types</li>
<li><code>ind-Nat</code> takes an extra argument between the target and the base called the motive</li>
<li>The motive is a function that returns the type of the expression at every step
<ul class="org-ul">
<li>this includes the base step</li>
<li>this means the motive determines the type of the <code>ind-Nat</code> expression as a whole</li>
</ul></li>
</ul>

<pre class="example">

(ind-Nat target
  motive
  base
  step)

</pre>

<p>
We said above that <code>ind-Nat</code> behaves like <code>rec-Nat</code> except that we can use it
with dependent types. This means that base and step return different dependent
types. The arguments to <code>ind-Nat</code> are:
</p>

<ul class="org-ul">
<li><code>target</code> : the initial <code>Nat</code></li>
<li><code>motive</code> : a function that is applied to the target at each step to
determine the type returned by that step, or the base when the
target is <code>zero</code></li>
<li><code>base</code> : the value to return when the <code>target</code> is <code>zero</code></li>
<li><code>step</code> : a function that accepts the value under the <code>add1</code> and the
recursive result of the computation at that step. The value of the
final (top-most) <code>step</code> is the value of the <code>ind-Nat</code> expression.</li>
</ul>

<p>
The workings of <code>ind-Nat</code> are best illustrated by example.
</p>
</div>
</div>
