little-books/4-the-little-typer/ch07/index.html

<div id="outline-container-org279a73a" class="outline-2">
<h2 id="org279a73a">Exercises</h2>
<div class="outline-text-2" id="text-org279a73a">
<p>
Suppose want to define a function that returns a specific number of <code>’peas</code>. We
could define the function to return a <code>(List Atom)</code> like this:
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #b294bb;">#lang</span> <span style="color: #cc6666;">pie</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> step-list-of-peas
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">-&gt;</span> Nat <span style="color: #de935f;">(</span><span style="color: #f0c674;">List</span> Atom<span style="color: #de935f;">)</span>
      <span style="color: #de935f;">(</span><span style="color: #f0c674;">List</span> Atom<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">step-list-of-peas</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">lambda</span> <span style="color: #de935f;">(</span>k-1 answer-k-1<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span>:: <span style="color: #2e8b57;">'pea</span> answer-k-1<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> list-of-peas
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">-&gt;</span> Nat <span style="color: #de935f;">(</span><span style="color: #f0c674;">List</span> Atom<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">list-of-peas</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">lambda</span> <span style="color: #de935f;">(</span>k<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span>rec-Nat k
      <span style="color: #b5bd68;">(</span>the <span style="color: #c9b4cf;">(</span><span style="color: #f0c674;">List</span> Atom<span style="color: #c9b4cf;">)</span> nil<span style="color: #b5bd68;">)</span>
      step-list-of-peas<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span>check-same <span style="color: #81a2be;">(</span><span style="color: #f0c674;">List</span> Atom<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span>:: <span style="color: #2e8b57;">'pea</span> nil<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span>list-of-peas <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span>check-same <span style="color: #81a2be;">(</span><span style="color: #f0c674;">List</span> Atom<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span>the <span style="color: #de935f;">(</span><span style="color: #f0c674;">List</span> Atom<span style="color: #de935f;">)</span> nil<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span>list-of-peas <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

</pre>
</div>

<p>
Using a list works in this case, but is unsatisfying because the type doesn’t
describe <i>how many</i> peas are returned. What if we modify the code to use a
Vector instead?
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #b294bb;">#lang</span> <span style="color: #cc6666;">pie</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> vec-of-peas
  <span style="color: #81a2be;">(</span>&#928; <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>k Nat<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
     <span style="color: #de935f;">(</span>Vec Atom k<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">vec-of-peas</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #de935f;">(</span>k<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span>rec-Nat k
      <span style="color: #b5bd68;">(</span>the <span style="color: #c9b4cf;">(</span>Vec Atom zero<span style="color: #c9b4cf;">)</span> vecnil<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #c9b4cf;">(</span>k-1 ans-k-1<span style="color: #c9b4cf;">)</span>
        <span style="color: #c9b4cf;">(</span>the <span style="color: #f0c674;">(</span>Vec Atom <span style="color: #81a2be;">(</span><span style="color: #81a2be;">add1</span> k-1<span style="color: #81a2be;">)</span><span style="color: #f0c674;">)</span>
             <span style="color: #f0c674;">(</span>vec:: <span style="color: #2e8b57;">'pea</span> ans-k-1<span style="color: #f0c674;">)</span><span style="color: #c9b4cf;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

</pre>
</div>

<p>
This definition <i>seems</i> like it should work, but results in an error because
<code>rec-Nat</code> isn’t able to work with dependent types. Now we’ll see how <code>ind-Nat</code>
allows us to specify the different specific types returned by the base and each
step.
</p>

<p>
The first objective is to define the motive. Here’s how we can reason about the
claim and definition of the motive, which we’ll call <code>motive-peas</code>. The motive
is a function that will be applied to the target and return the <b>type</b> of the
<code>ind-Nat</code> expression. The overall <code>peas</code> function is intended to return a
<code>Vector</code> of Atoms, and the Vector type describes the exact length of the Vector.
So we can reason that the motive will require a specific <code>Nat</code> describing the
length of the Vector and will return a <i>type</i> that is a Vector of that length.
In order to incorporate the specific <code>Nat</code>, we’ll introduce a binding for it in
the claim with a <code>\Pi</code> expression.
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #b294bb;">#lang</span> <span style="color: #cc6666;">pie</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> motive-peas
  <span style="color: #81a2be;">(</span>&#928; <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>l Nat<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
     <span style="color: #f0c674;">U</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">motive-peas</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #de935f;">(</span>l<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span>Vec Atom l<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

</pre>
</div>

<p>
Notice that the motive returns the type <code>(Vec Atom zero)</code> if we call <code>(peas 0)</code>.
Since the only <code>(Vec Atom zero)</code> is <code>vecnil</code>, we already know that will be the
<code>base</code> in the <code>ind-Nat</code> expression as well as the overall return value for
<code>(peas 0)</code>. At this point, we know the <code>target</code>, <code>motive</code>, and <code>base</code> of the
<code>ind-Nat</code> expression, leaving only the <code>step</code> to figure out.
</p>

<p>
The step function for <code>ind-Nat</code> behaves just as the step function for <code>rec-Nat</code>
which means that it will receive two arguments when the target is <code>(the Nat
(add1 k))</code>. The first argument will be <code>(the Nat k)</code> (eliminating an <code>add1</code>),
and the second argument will be the recursive result of the step function for
<code>(the Nat k)</code>.
</p>

<p>
We can discover the correct implementation of <code>step-peas</code> by reasoning about a
simple case. Let’s assume we’re computing the value of <code>(peas two)</code> which is
<code>(peas (add1 (add1 zero)))</code>. This means the <code>target</code> of the <code>ind-Nat</code> expression
is <code>two</code>. We know that the step function will be given two arguments <code>(add1
zero)</code> and <code>(vec:: ’pea vecnil)</code>. The implementation of the step function must
clearly use the <code>vec::</code> constructor to tack another <code>’pea</code> onto the recursive
result.
</p>

<p>
The claim is the tricky part. We know that we will need the value of the
<code>Nat</code> to be used in the type definition, so we will need a <code>\Pi</code> expression. Since
step is a function, we know the claim returns a function type. But how do we
specify the type of the arguments and return value? It turns out we’ve already
done that work. Both the second argument and the return value are the result of
the step function. The point of introducing the <code>motive</code> was to calculate the
result of the step function, so we <i>invoke</i> the motive in the claim to find the
right type!
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> step-peas
  <span style="color: #81a2be;">(</span>&#928; <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>l-1 Nat<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
     <span style="color: #de935f;">(</span><span style="color: #81a2be;">-&gt;</span> <span style="color: #b5bd68;">(</span>motive-peas l-1<span style="color: #b5bd68;">)</span>
         <span style="color: #b5bd68;">(</span>motive-peas <span style="color: #c9b4cf;">(</span><span style="color: #81a2be;">add1</span> l-1<span style="color: #c9b4cf;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">step-peas</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #de935f;">(</span>l-1<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #b5bd68;">(</span>answer-l-1<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span>vec:: <span style="color: #2e8b57;">'pea</span> answer-l-1<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

</pre>
</div>

<p>
With all of the parts of the <code>ind-Nat</code> expression defined, it’s trivial to
stitch them together and check our work.
</p>

<div class="org-src-container">
<pre class="src src-racket">
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> peas
  <span style="color: #81a2be;">(</span>&#928; <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>l Nat<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
     <span style="color: #de935f;">(</span>Vec Atom l<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">peas</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #de935f;">(</span>l<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span>ind-Nat l
      motive-peas
      vecnil
      step-peas<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span>check-same
 <span style="color: #81a2be;">(</span>Vec Atom <span style="color: #de935f; font-weight: bold;">5</span><span style="color: #81a2be;">)</span>
 <span style="color: #81a2be;">(</span>the <span style="color: #de935f;">(</span>Vec Atom <span style="color: #de935f; font-weight: bold;">5</span><span style="color: #de935f;">)</span>
      <span style="color: #de935f;">(</span>vec:: <span style="color: #2e8b57;">'pea</span>
             <span style="color: #b5bd68;">(</span>vec:: <span style="color: #2e8b57;">'pea</span>
                    <span style="color: #c9b4cf;">(</span>vec:: <span style="color: #2e8b57;">'pea</span>
                           <span style="color: #f0c674;">(</span>vec:: <span style="color: #2e8b57;">'pea</span>
                                  <span style="color: #81a2be;">(</span>vec:: <span style="color: #2e8b57;">'pea</span> vecnil<span style="color: #81a2be;">)</span><span style="color: #f0c674;">)</span><span style="color: #c9b4cf;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
 <span style="color: #81a2be;">(</span>peas <span style="color: #de935f; font-weight: bold;">5</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
</div>

<p>
Now we can move on to something slightly more complex. In this section, we will
implement the <code>last</code> function, which returns the last element of a vector of any
type. There is an interesting tension that we have to resolve. The first is that
all functions in Pie must be <i>total</i> functions.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> motive-last
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">-&gt;</span> <span style="color: #f0c674;">U</span> Nat
      <span style="color: #f0c674;">U</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">motive-last</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #de935f;">(</span>E k<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #81a2be;">-&gt;</span> <span style="color: #b5bd68;">(</span>Vec E <span style="color: #c9b4cf;">(</span><span style="color: #81a2be;">add1</span> k<span style="color: #c9b4cf;">)</span><span style="color: #b5bd68;">)</span>
        E<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> base-last
  <span style="color: #81a2be;">(</span>&#928; <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>E <span style="color: #f0c674;">U</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
     <span style="color: #de935f;">(</span><span style="color: #81a2be;">-&gt;</span> <span style="color: #b5bd68;">(</span>Vec E <span style="color: #c9b4cf;">(</span><span style="color: #81a2be;">add1</span> zero<span style="color: #c9b4cf;">)</span><span style="color: #b5bd68;">)</span>
         E<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">base-last</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #de935f;">(</span>E<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #b5bd68;">(</span>es<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span>head es<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> step-last
  <span style="color: #81a2be;">(</span>&#928; <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>E <span style="color: #f0c674;">U</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span>k Nat<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
     <span style="color: #de935f;">(</span><span style="color: #81a2be;">-&gt;</span> <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">-&gt;</span> <span style="color: #c9b4cf;">(</span>Vec E <span style="color: #f0c674;">(</span><span style="color: #81a2be;">add1</span> k<span style="color: #f0c674;">)</span><span style="color: #c9b4cf;">)</span> E<span style="color: #b5bd68;">)</span>
         <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">-&gt;</span> <span style="color: #c9b4cf;">(</span>Vec E <span style="color: #f0c674;">(</span><span style="color: #81a2be;">add1</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">add1</span> k<span style="color: #81a2be;">)</span><span style="color: #f0c674;">)</span><span style="color: #c9b4cf;">)</span>
             E<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">step-last</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #de935f;">(</span>E<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #b5bd68;">(</span>n-1 last-of-n-1<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #c9b4cf;">(</span>es<span style="color: #c9b4cf;">)</span>
        <span style="color: #c9b4cf;">(</span>last-of-n-1 <span style="color: #f0c674;">(</span>tail es<span style="color: #f0c674;">)</span><span style="color: #c9b4cf;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">claim</span> <span style="color: #81a2be;">last</span>
  <span style="color: #81a2be;">(</span>&#928; <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>E <span style="color: #f0c674;">U</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span>k Nat<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
     <span style="color: #de935f;">(</span><span style="color: #81a2be;">-&gt;</span> <span style="color: #b5bd68;">(</span>Vec E <span style="color: #c9b4cf;">(</span><span style="color: #81a2be;">add1</span> k<span style="color: #c9b4cf;">)</span><span style="color: #b5bd68;">)</span>
         E<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">define</span> <span style="color: #cc6666;">last</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #de935f;">(</span>E k<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">&#955;</span> <span style="color: #b5bd68;">(</span>es<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #c9b4cf;">(</span>ind-Nat k
         <span style="color: #f0c674;">(</span>motive-last E<span style="color: #f0c674;">)</span>
         <span style="color: #f0c674;">(</span>base-last E<span style="color: #f0c674;">)</span>
         <span style="color: #f0c674;">(</span>step-last E<span style="color: #f0c674;">)</span><span style="color: #c9b4cf;">)</span> es<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span>check-same
 Atom
 <span style="color: #2e8b57;">'Done</span>
 <span style="color: #81a2be;">(</span><span style="color: #81a2be;">last</span> Atom <span style="color: #de935f; font-weight: bold;">0</span> <span style="color: #de935f;">(</span>vec:: <span style="color: #2e8b57;">'Done</span> vecnil<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span>check-same
 Atom
 <span style="color: #2e8b57;">'Coming</span>
 <span style="color: #81a2be;">(</span><span style="color: #81a2be;">last</span> Atom <span style="color: #de935f; font-weight: bold;">2</span> <span style="color: #de935f;">(</span>vec:: <span style="color: #2e8b57;">'Winter</span> <span style="color: #b5bd68;">(</span>vec:: <span style="color: #2e8b57;">'Is</span> <span style="color: #c9b4cf;">(</span>vec:: <span style="color: #2e8b57;">'Coming</span>  vecnil<span style="color: #c9b4cf;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
